DataProcessors/ВыгрузкаДанныхСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДанныхСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВыгрузкаДанныхСотрудников/Ext/ManagerModule.bsl
//+++АК LATV 2018.07.24 0-000018902
Функция КодДляВыполненияВПериодическихЗаданиях(ТекущаяОбработка, Параметры) Экспорт

	// Выполнение отчета
	ВыполняемаяОбработка = Обработки.ВыгрузкаДанныхСотрудников.Создать();
	
	ВыполняемаяОбработка.ДатаУвольнения	= Параметры.ДатаУвольнения;
	ВыполняемаяОбработка.ИмяФайла		= Параметры.ИмяФайла;
	
	ВыполняемаяОбработка.Выгрузить();

КонецФункции
